<h4>Q.1 Create a pandas Series that contain the following data: 4,8,15,16,23 and 42 . Then , print the series.</h4>
<h4>Ans:</h4>

In [1]:
import pandas as pd
data=[4,8,15,16,23,42]
my_series=pd.Series(data)
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<h4> Q.2 Create a variable of list type containing 10 elements in it , and apply pandas. Series function on the variable print it.</h4>
<h4>Ans:</h4>

In [2]:
data1=[1,2,3,4,5,6,7,8,9,10]
my_series1=pd.Series(data1)
print(my_series1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

 #<h4> Q.3 Create a Pandas DataFrames that contain the following data. </h4>
| Name | Age | Gender |
| ----| -----| -------|
| Alice | 25 | Female |
| Bob | 30 | Male |
| Claire | 27 | Female |
<h4>Then,print the DataFrame. </h4>
<h4>Ans:</h4>

In [3]:
data={"Name":["Alice","Bob","Claire"],
     "Age":["25","30","27"] ,
     "Gender":["Female","Male","Female"]}
df=pd.DataFrame(data)

In [4]:
df

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

<h4> Q.4 What is 'DataFrame' in pandas and how is it different from pandas.series ? Explain with an example.</h4>
<h4> Ans:</h4>

In [5]:
# What is DataFrame:
#      In pandas, a DataFrame is a two-dimensional labeled data structure, similar to a table or spreadsheet. It consists of rows and columns, where
# each column can be of a different data type. It is the most commonly used data structure in pandas and provides a powerful way to manipulate and 
# analyze data.

# What is pandas.series :
#     On the other hand, a pandas Series is a one-dimensional labeled array that can contain data of any type (e.g., integers, strings, floats, etc.).
# It can be thought of as a single column of data, with an index that labels each element in the Series.

# Diffferance between Dataframe and pandas.series:
#    The main difference between a DataFrame and a Series is that a DataFrame is a two-dimensional data structure, while a Series is a one-dimensional 
# data structure. A DataFrame can be thought of as a collection of Series objects, where each Series represents a column in the DataFrame.

# Here's an example that shows the difference between a DataFrame and a Series:


# Create a dictionary of data
data = {'Name': ['Joti', 'Manisha', 'Sanika', 'Anita'],
        'Age': [25, 30, 35, 40],
        'Country': ['USA', 'Canada', 'Australia', 'UK']}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)

# Create a Series from a single column of the DataFrame
name_series = df['Name']

# Print the DataFrame and the Series
print('DataFrame:')
print(df)
print('\nSeries:')
print(name_series)

DataFrame:
      Name  Age    Country
0     Joti   25        USA
1  Manisha   30     Canada
2   Sanika   35  Australia
3    Anita   40         UK

Series:
0       Joti
1    Manisha
2     Sanika
3      Anita
Name: Name, dtype: object

<h4> Q.5 What are some common function you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these 
functions ? </h4>
<h4>Ans:</h4>

In [6]:
# Pandas provides a wide range of functions to manipulate data in a DataFrame. Some common functions include:

# 1.head(): Returns the first n rows of the DataFrame. This function is useful for quickly inspecting the data in the DataFrame.

# 2.tail(): Returns the last n rows of the DataFrame. This function is useful for quickly inspecting the end of the data in the DataFrame.

# 3.info(): Prints a concise summary of the DataFrame, including the number of non-null values and data types of each column.

# 4.describe(): Generates descriptive statistics for the DataFrame, including count, mean, standard deviation, minimum and maximum values, and quartile
#              ranges.

# 5.drop(): Removes rows or columns from the DataFrame based on the specified index or column labels.

# 6.groupby(): Groups the DataFrame by one or more columns and applies a function (e.g., mean, sum, count) to each group.

# 7.sort_values(): Sorts the DataFrame by one or more columns.

# 8.fillna(): Fills missing values in the DataFrame with a specified value or using a method such as forward or backward fill.

# Here's an example of when you might use one of these functions:

#  a DataFrame containing data on customer orders, including the order ID, customer name, order date, and total order amount. You want to group the 
# orders by customer name and calculate the total amount spent by each customer. To do this, you could use the groupby() function as follows:

import pandas as pd

# Create the DataFrame
data2 = {'OrderID': [1, 2, 3, 4, 5],
        'Customer': ['John', 'Mary', 'Bob', 'Mary', 'John'],
        'OrderDate': ['2022-01-01', '2022-02-02', '2022-03-03', '2022-04-04', '2022-05-05'],
        'TotalAmount': [100, 200, 150, 250, 300]}
df = pd.DataFrame(data2)

# Group the orders by customer and calculate the total amount spent by each customer
customer_totals = df.groupby('Customer')['TotalAmount'].sum()

# Print the result
print(customer_totals)

Customer
Bob     150
John    400
Mary    450
Name: TotalAmount, dtype: int64

<h4>Q.6 Which of the following is mutable in nature Series , DataFrame, Panel?</h4>
<h4>Ans:</h4>

In [7]:
#      In Pandas, both Series and DataFrame are mutable in nature, which means that you can modify their data after they have been created.

#      A Series is a one-dimensional array-like object that can hold any data type. You can modify the values in a Series by using indexing or boolean 
# indexing. For example:

# Create a Series
s = pd.Series([1, 2, 3, 4, 5])

# Modify a value in the Series
s[2] = 10

# Print the modified Series
print(s)

0     1
1     2
2    10
3     4
4     5
dtype: int64

In [8]:
#       A DataFrame is a two-dimensional table-like data structure that can also hold any data type. You can modify the values in a DataFrame by using 
# indexing or boolean indexing, or by using functions such as loc[] and iloc[]. For example:

# Create a DataFrame
data2 = {'name': ['Anita', 'Mina', 'Riya', 'Durva'],
        'age': [25, 30, 35, 40],
        'gender': ['F', 'M', 'M', 'M']}
df2 = pd.DataFrame(data2)

# Modify a value in the DataFrame
df2.loc[2, 'age'] = 36

In [9]:
df2

    name  age gender
0  Anita   25      F
1   Mina   30      M
2   Riya   36      M
3  Durva   40      M

<h4> Q.7 Create a DataFrame using multiple Series. Explain with an example .</h4>
<h4> Ans:</h4>

In [17]:
#    In Pandas, we can create a DataFrame using multiple Series. Each Series represents a column in the DataFrame, and all Series must have
# the same length.

# Here's an example of how to create a DataFrame using multiple Series:


#  Create the Series
names = pd.Series(['Sanjana', 'miya', 'Sanika', 'Dave'])
ages = pd.Series([25, 30, 35, 40])
genders = pd.Series(['F', 'M', 'M', 'M'])

# Create the DataFrame
df = pd.DataFrame({'Name': names, 'Age': ages, 'Gender': genders})

# Print the DataFrame

In [76]:
df

      Name  Age Gender
0  Sanjana   25      F
1     miya   30      M
2   Sanika   35      M
3     Dave   40      M